---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AtomTouchedNotAllowedDelete
source: html/7d4c93b4-5aef-8406-50e4-41f5ee02bc0b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AtomTouchedNotAllowedDelete Property

Changes to groups are only allowed during Edit Group mode. Use Edit Group to make this change.

## Syntax (C#)
```csharp
public static FailureDefinitionId AtomTouchedNotAllowedDelete { get; }
```